export const MESSAGE = {
  AWARD: {
    NOT_FOUND: 'ไม่พบผลการออกรางวัล',
    DUPLICATE: 'มีรายชื่อในระบบธนาคารอยู่แล้ว ไม่สามารถใช้รายชื่อนี้ได้',
    NOT_REWARD: 'ไม่สามารถออกรางวัลได้ เนื่องจากวันที่ออกรางวัลไม่ได้อยู่ในช่วงวันที่ที่ต้องการออกรางวัล'
  },
  CATEGORY: {
    NOT_FOUND: 'ไม่พบหมวดหมู่ผลการออกรางวัล',
    DUPLICATE_NAME: 'มีชื่อหมวดหมู่ผลการออกรางวัลอยู่แล้ว ไม่สามารถใช้ชื่อหมวดหมู่ผลการออกรางวัลนี้ได้',
    DUPLICATE_CODE: 'มีโค๊ดผลการออกรางวัลอยู่แล้ว ไม่สามารถใช้โค๊ดผลการออกรางวัลนี้ได้'
  },
  AWARD_TYPE: {
    NOT_FOUND: 'ไม่พบประเภทผลการออกรางวัล',
    DUPLICATE: 'มีชื่อประเภทผลการออกรางวัลอยู่แล้ว ไม่สามารถใช้ชื่อประเภทผลการออกรางวัลนี้ได้'
  },
  GROUP: {
    NOT_FOUND: 'ไม่พบกลุ่มผลการออกรางวัล',
    DUPLICATE_NAME: 'มีชื่อกลุ่มผลการออกรางวัลอยู่แล้ว ไม่สามารถใช้ชื่อกลุ่มผลการออกรางวัลนี้ได้',
    DUPLICATE_CODE: 'มีโค๊ดผลการออกรางวัลอยู่แล้ว ไม่สามารถใช้โค๊ดผลการออกรางวัลนี้ได้'
  },
  EXCHANGE: {
    NOT_FOUND: 'ไม่พบการอัตตราการแลกเปลี่ยน',
    DUPLICATE: 'มีการอัตราการแลกเปลี่ยนอยู่แล้ว ไม่สามารถสร้างอัตราการแลกเปลี่ยนนี้ได้'
  }
}
